12/data/attachments/be1cd07a9ec059ea.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2fd3d9cc-d388-43ad-bd6b-19b33b81e3cb</nif:username>
            <nif:friendToBeAdded>Jason_garden_Friend_96253_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>